#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PPM-API-CGI-BC30550160.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PPM-API-CGI-BC30550160.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "system/*.read",
          + "system/*.write",
          + "system/Claim.read",
          + "system/Claim.write",
          + "system/Consent.read",
          + "system/Consent.write",
          + "system/Location.read",
          + "system/Medication.read",
          + "system/MedicationDispense.read",
          + "system/MedicationDispense.write",
          + "system/MedicationRequest.read",
          + "system/MedicationRequest.write",
          + "system/MedicationStatement.read",
          + "system/MedicationStatement.write",
          + "system/Patient.read",
          + "system/Patient.write",
          + "system/Practitioner.read",
        ]
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PPM-API-CGI-BC30550160.keycloak_openid_user_session_note_protocol_mapper.Client-Host will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-Host" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientHost"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client Host"
      + realm_id            = "moh_applications"
      + session_note        = "clientHost"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PPM-API-CGI-BC30550160.keycloak_openid_user_session_note_protocol_mapper.Client-ID will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-ID" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientId"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client ID"
      + realm_id            = "moh_applications"
      + session_note        = "clientId"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PPM-API-CGI-BC30550160.keycloak_openid_user_session_note_protocol_mapper.Client-IP-Address will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-IP-Address" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientAddress"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client IP Address"
      + realm_id            = "moh_applications"
      + session_note        = "clientAddress"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PPM-API-CGI-BC30550160.keycloak_openid_user_session_note_protocol_mapper.Pharmanet-Audience will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Pharmanet-Audience" {
      + add_to_access_token = true
      + add_to_id_token     = false
      + claim_name          = "pharmanet"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Pharmanet Audience"
      + realm_id            = "moh_applications"
      + session_note        = "pharmanet"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @daveb-hni, Action: `pull_request`*